SET @temp := (
           SELECT SUM(temp) 
             FROM (SELECT SUM(price*amount) AS temp 
                     FROM book) AS temp2
          );
SELECT author, title, price, amount, 
       ROUND(((price*amount) / @temp) * 100,2) AS income_percent
  FROM book
 ORDER BY income_percent DESC;


+------------------+-----------------------+--------+--------+----------------+
| author           | title                 | price  | amount | income_percent |
+------------------+-----------------------+--------+--------+----------------+
| Есенин С.А.      | Стихотворения и поэмы | 650.00 | 15     | 33.83          |
| Достоевский Ф.М. | Игрок                 | 480.50 | 10     | 16.67          |
| Достоевский Ф.М. | Идиот                 | 460.00 | 10     | 15.96          |
| Есенин С.А.      | Черный человек        | 670.99 | 5      | 11.64          |
| Булгаков М.А.    | Белая гвардия         | 540.50 | 5      | 9.38           |
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 | 3      | 6.98           |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 | 2      | 5.54           |
+------------------+-----------------------+--------+--------+----------------+