SELECT name_author, name_genre, COUNT(title) AS Количество
  FROM author
     CROSS JOIN genre
     LEFT JOIN book ON book.author_id = author.author_id AND genre.genre_id = book.genre_id
 GROUP BY name_author, name_genre
 ORDER BY name_author, Количество DESC, name_genre;


+------------------+-------------+------------+
| name_author      | name_genre  | Количество |
+------------------+-------------+------------+
| Булгаков М.А.    | Роман       | 2          |
| Булгаков М.А.    | Поэзия      | 0          |
| Булгаков М.А.    | Приключения | 0          |
| Достоевский Ф.М. | Роман       | 3          |
| Достоевский Ф.М. | Поэзия      | 0          |
| Достоевский Ф.М. | Приключения | 0          |
| Есенин С.А.      | Поэзия      | 2          |
| Есенин С.А.      | Приключения | 0          |
| Есенин С.А.      | Роман       | 0          |
| Лермонтов М.Ю.   | Поэзия      | 0          |
| Лермонтов М.Ю.   | Приключения | 0          |
| Лермонтов М.Ю.   | Роман       | 0          |
| Пастернак Б.Л.   | Поэзия      | 1          |
| Пастернак Б.Л.   | Приключения | 0          |
| Пастернак Б.Л.   | Роман       | 0          |
+------------------+-------------+------------+