SELECT author AS Автор, title AS Название_книги, price AS Цена,
  CASE 
      WHEN price>500 AND price<=600 THEN 'ручка'
      WHEN price>600 AND price<=700 THEN 'детская раскраска'
      WHEN price>700 THEN 'гороскоп'
   END AS Подарок
  FROM book
 WHERE price >=500
 ORDER BY Автор, Название_книги;

+------------------+-----------------------+--------+-------------------+
| Автор            | Название_книги        | Цена   | Подарок           |
+------------------+-----------------------+--------+-------------------+
| Булгаков М.А.    | Белая гвардия         | 540.50 | ручка             |
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 | детская раскраска |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 | гороскоп          |
| Есенин С.А.      | Стихотворения и поэмы | 650.00 | детская раскраска |
| Есенин С.А.      | Черный человек        | 670.99 | детская раскраска |
+------------------+-----------------------+--------+-------------------+