SELECT author AS Автор,
       MIN(amount) AS Наименьшее_кол_во,
       MAX(amount) AS Наибольшее_кол_во 
  FROM book 
 GROUP BY author
HAVING SUM(amount) < 10;


+----------------+-------------------+-------------------+
| Автор          | Наименьшее_кол_во | Наибольшее_кол_во |
+----------------+-------------------+-------------------+
| Булгаков М.А.  | 3                 | 5                 |
| Пастернак Б.Л. | 6                 | 6                 |
+----------------+-------------------+-------------------+