SELECT author, title, price, amount, IF(price > 600, ROUND(price*0.20, 2), '-') AS sale_20, 
       IF(price > 600, ROUND(price-price*0.20, 2), '-') AS price_sale
  FROM book
ORDER BY author, title;



+------------------+-----------------------+--------+--------+---------+------------+
| author           | title                 | price  | amount | sale_20 | price_sale |
+------------------+-----------------------+--------+--------+---------+------------+
| Булгаков М.А.    | Белая гвардия         | 540.50 | 5      | -       | -          |
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 | 3      | 134.20  | 536.79     |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 | 3      | 159.80  | 639.21     |
| Достоевский Ф.М. | Игрок                 | 480.50 | 10     | -       | -          |
| Достоевский Ф.М. | Идиот                 | 460.00 | 10     | -       | -          |
| Есенин С.А.      | Стихотворения и поэмы | 650.00 | 15     | 130.00  | 520.00     |
+------------------+-----------------------+--------+--------+---------+------------+