SELECT author AS Автор, title AS Название_книги, amount AS Количество, 
       ROUND(price, 2) AS Розничная_цена, IF(amount >= 10, 15, 0) AS Скидка,
       IF(amount >= 10, ROUND(price - price * 0.15, 2), price) AS Оптовая_цена
FROM book
ORDER BY author, title;



+------------------+-----------------------+------------+----------------+--------+--------------+
| Автор            | Название_книги        | Количество | Розничная_цена | Скидка | Оптовая_цена |
+------------------+-----------------------+------------+----------------+--------+--------------+
| Булгаков М.А.    | Белая гвардия         | 5          | 540.50         | 0      | 540.50       |
| Булгаков М.А.    | Мастер и Маргарита    | 3          | 670.99         | 0      | 670.99       |
| Достоевский Ф.М. | Братья Карамазовы     | 3          | 799.01         | 0      | 799.01       |
| Достоевский Ф.М. | Игрок                 | 10         | 480.50         | 15     | 408.43       |
| Достоевский Ф.М. | Идиот                 | 10         | 460.00         | 15     | 391.00       |
| Есенин С.А.      | Стихотворения и поэмы | 15         | 650.00         | 15     | 552.50       |
+------------------+-----------------------+------------+----------------+--------+--------------+