SELECT 'Донцова Дарья' AS author, CONCAT('Евлампия Романова и ', title) AS title,
        ROUND(price * 1.42, 2) AS price
FROM book
ORDER BY price DESC;



+---------------+-------------------------------------------+---------+
| author        | title                                     | price   |
+---------------+-------------------------------------------+---------+
| Донцова Дарья | Евлампия Романова и Братья Карамазовы     | 1134.59 |
| Донцова Дарья | Евлампия Романова и Мастер и Маргарита    | 952.81  |
| Донцова Дарья | Евлампия Романова и Стихотворения и поэмы | 923.00  |
| Донцова Дарья | Евлампия Романова и Белая гвардия         | 767.51  |
| Донцова Дарья | Евлампия Романова и Игрок                 | 682.31  |
| Донцова Дарья | Евлампия Романова и Идиот                 | 653.20  |
+---------------+-------------------------------------------+---------+