SELECT author, title,
  CASE
      WHEN price < 500 THEN 'низкая'
      WHEN price BETWEEN 500 AND 700 THEN 'средняя'
      ELSE 'высокая'
   END AS price_category, price * amount AS cost
  FROM book
 WHERE author <> 'Есенин С.А.' AND title <> 'Белая гвардия'
ORDER BY cost DESC, title;



+------------------+--------------------+----------------+---------+
| author           | title              | price_category | cost    |
+------------------+--------------------+----------------+---------+
| Достоевский Ф.М. | Игрок              | низкая         | 4805.00 |
| Достоевский Ф.М. | Идиот              | низкая         | 4600.00 |
| Достоевский Ф.М. | Братья Карамазовы  | высокая        | 2397.03 |
| Булгаков М.А.    | Мастер и Маргарита | средняя        | 2012.97 |
+------------------+--------------------+----------------+---------+