SELECT title, author, amount,
       (
        SELECT MAX(price * amount)
        FROM book
       ) - amount * price AS Разница_с_макс_стоимостью
FROM book
WHERE amount % 2 = 1
ORDER BY Разница_с_макс_стоимостью DESC;



+-----------------------+------------------+--------+---------------------------+
| title                 | author           | amount | Разница_с_макс_стоимостью |
+-----------------------+------------------+--------+---------------------------+
| Мастер и Маргарита    | Булгаков М.А.    | 3      | 7737.03                   |
| Братья Карамазовы     | Достоевский Ф.М. | 3      | 7352.97                   |
| Белая гвардия         | Булгаков М.А.    | 5      | 7047.50                   |
| Стихотворения и поэмы | Есенин С.А.      | 15     | 0.00                      |
+-----------------------+------------------+--------+---------------------------+