SELECT title AS Наименование, price AS Цена,  
  CASE 
      WHEN amount <= 5 THEN '500'
      ELSE 'Бесплатно'
   END AS Стоимость_доставки
  FROM book
 WHERE price > 600
 ORDER BY price DESC;



+-----------------------+--------+--------------------+
| Наименование          | Цена   | Стоимость_доставки |
+-----------------------+--------+--------------------+
| Братья Карамазовы     | 799.01 | 500                |
| Мастер и Маргарита    | 670.99 | 500                |
| Черный человек        | 670.99 | 500                |
| Стихотворения и поэмы | 650.00 | Бесплатно          |
+-----------------------+--------+--------------------+