SELECT author, title, amount, price,
  CASE
      WHEN amount >= 5 THEN '50%'
      WHEN price >= 700 THEN '20%'
      ELSE '10%' 
   END AS Скидка, 
  CASE
      WHEN amount >= 5 THEN ROUND(price * 0.5, 2)
      WHEN price >= 700 THEN ROUND(price * 0.8, 2)
      ELSE ROUND(price * 0.9, 2)
   END AS Цена_со_скидкой
FROM book; 



+------------------+-----------------------+--------+--------+--------+-----------------+
| author           | title                 | amount | price  | Скидка | Цена_со_скидкой |
+------------------+-----------------------+--------+--------+--------+-----------------+
| Булгаков М.А.    | Мастер и Маргарита    | 3      | 670.99 | 10%    | 603.89          |
| Булгаков М.А.    | Белая гвардия         | 5      | 540.50 | 50%    | 270.25          |
| Достоевский Ф.М. | Идиот                 | 10     | 460.00 | 50%    | 230.00          |
| Достоевский Ф.М. | Братья Карамазовы     | 3      | 799.01 | 20%    | 639.21          |
| Достоевский Ф.М. | Игрок                 | 10     | 480.50 | 50%    | 240.25          |
| Есенин С.А.      | Стихотворения и поэмы | 15     | 650.00 | 50%    | 325.00          |
| Есенин С.А.      | Черный человек        | 5      | 670.99 | 50%    | 335.50          |
+------------------+-----------------------+--------+--------+--------+-----------------+