SELECT question_id, name_question
FROM subject
     INNER JOIN question USING(subject_id)
WHERE name_subject = 'Основы баз данных'
ORDER BY RAND()
LIMIT 3;



+-------------+-----------------------------------------------------+
| question_id | name_question                                       |
+-------------+-----------------------------------------------------+
| 8           | Концептуальная модель используется для              |
| 9           | Какой тип данных не допустим в реляционной таблице? |
| 6           | База данных - это:                                  |
+-------------+-----------------------------------------------------+