SELECT name_question, name_answer, IF(is_correct = 0, 'Неверно', 'Верно') AS Результат
  FROM testing
       INNER JOIN question USING(question_id)
       INNER JOIN   answer USING(answer_id)
 WHERE attempt_id = 7;


+----------------------------------------------------------------------------------------------+
| name_question                                            | name_answer           | Результат |
+----------------------------------------------------------+-----------------------+-----------+
| Запрос на выборку начинается с ключевого слова:          | INSERT                | Неверно   |
| Какой запрос выбирает все записи из таблицы student:     | SELECT * FROM student | Верно     |
| Для внутреннего соединения таблиц используется оператор: | CROSS JOIN            | Неверно   |
+----------------------------------------------------------+-----------------------+-----------+