SELECT CONCAT(module_id, ' ', LEFT(CONCAT(module_name), 14), '...') AS Модуль, 
       CONCAT(module_id, '.', lesson_position, ' ', CONCAT(LEFT(CONCAT(lesson_name), 12), '...')) AS Урок,
       CONCAT(module_id, '.', lesson_position, '.', step_position, ' ', step_name) AS Шаг
       
  FROM module
       INNER JOIN lesson USING(module_id)
       INNER JOIN   step USING(lesson_id)
WHERE step_name LIKE '%_ложенн% запро_%'
ORDER BY module_id ASC, lesson_id ASC, step_id ASC;


+---------------------+---------------------+-------------------------------------------------------------+
| Модуль              | Урок                | Шаг                                                         |
+---------------------+---------------------+-------------------------------------------------------------+
| 1 Основы реляцио... | 1.4 Вложенные за... | 1.4.2 Вложенный запрос, возвращающий одно значение          |
| 1 Основы реляцио... | 1.4 Вложенные за... | 1.4.3 Использование вложенного запроса в выражении          |
| 1 Основы реляцио... | 1.4 Вложенные за... | 1.4.4 Вложенный запрос, оператор IN                         |
| 1 Основы реляцио... | 1.4 Вложенные за... | 1.4.5 Вложенный запрос, операторы ANY и ALL                 |
| 1 Основы реляцио... | 1.4 Вложенные за... | 1.4.6 Вложенный запрос после SELECT                         |
| 1 Основы реляцио... | 1.5 Запросы корр... | 1.5.5 Добавление записей, вложенные запросы                 |
| 2 Запросы SQL к ... | 2.2 Запросы на в... | 2.2.7 Запросы для нескольких таблиц со вложенными запросами |
| 2 Запросы SQL к ... | 2.2 Запросы на в... | 2.2.8 Вложенные запросы в операторах соединения             |
| 2 Запросы SQL к ... | 2.3 Запросы корр... | 2.3.5 Запрос на обновление, вложенные запросы               |
+---------------------+---------------------+-------------------------------------------------------------+